
#include "link_head.h"

Node *root = NULL;
int main( int argc, char **argv )
{
/* ----------------------------------------------------------------------------------------------  */
    Input_Nodes( &root ); /* 输入结点  */
    if ( NULL == root )
	printf( "没有输入过数据!" );
    else {
	printf( "结点排序前: " ); 
	Print_Nodes( root );

	printf( "结点排序后: " ); 
	Sorting_Nodes( root );
	Print_Nodes( root );

	printf( "统计的结点个数: %d \n", Statistical_Nodes( root ) );
    }
    getchar();

#if NUL
    /* 读掉多余空白符  */
    while ( '\n' != getchar() )
	continue; 
#endif
/* ----------------------------------------------------------------------------------------------  */



/* ----------------------------------------------------------------------------------------------  */
    /* 输入新插入的数据  */
    int new_val;
    printf( "输入一个新的值: " );
    scanf_s( "%d%*c", &new_val );

    /* 检查新插入的数据是否在表中已存在, 存在则提示重新输入, 否则直到数据输入到不存在为止  */
    while ( !Examine_Nodes( root, new_val ) ) { 
	printf( "新插入的数据在表中已存在, 请重新输入其它的数据: " );
	scanf_s( "%d%*c", &new_val );
    }

    /* 插入新的值, 并显示插入新值后的列表并显示插入新值后统计的结点个数  */
    if ( Insert_Nodes( &root, new_val ) ) {
	printf( "插入新值后的列表: " );
	Print_Nodes( root );
	printf( "插入新值后的列表统计的结点个数: %d", Statistical_Nodes( root ) );
    }
    else
	printf( "输入有误! \n" );
    putchar( '\n' );
/* ----------------------------------------------------------------------------------------------  */



/* ----------------------------------------------------------------------------------------------  */
    /* 输入需要删除的数据  */
    int del_By_Val;
    printf( "输入需要删除的值: " );
    scanf_s( "%d%*c", &del_By_Val );

    /* 检查需要删除的数据是否在表中已存在, 不存在则提示重新输入, 否则直到数据输入到表中存在为止  */
    while ( !Examine_Nodes( root, del_By_Val ) ) {
        printf( "你要删除的数据在表中不存在, 请重新输入一个在表中存在的值: " );
	scanf_s( "%d%*c", &del_By_Val );
    }

    /* 删除新的值, 并显示删除新值后的列表并显示删除新值后统计的结点个数  */
    Delete_Nodes( &root, del_By_Val );
    printf( "删除新值后的列表: " ); 
    Print_Nodes( root );
    printf( "删除新值后的列表统计的结点个数: %d", Statistical_Nodes( root ) );
    putchar('\n');
/* ----------------------------------------------------------------------------------------------  */



/* ----------------------------------------------------------------------------------------------  */
    ClearUp_Memory( &root ); /* 释放链表中所有的内存  */
/* ----------------------------------------------------------------------------------------------  */


    system("pause");
    return 0;
}
